/**
 * 折线图、柱状图单数据
 */
export const dataset_sgl = [
  ["", "营业额"],
  ["星期一", 2500],
  ["星期二", 8000],
  ["星期三", 1000],
  ["星期四", 5000],
  ["星期五", 7000],
  ["星期六", 6000],
  ["星期日", 3000],
];

/**
 * 折线图、柱状图多数据（少量版）
 */
export const dataset_mult_less = [
  ["营业额", "零食", "饮料"],
  ["星期一", 2500, 1000],
  ["星期二", 8000, 2000],
  ["星期三", 3000, 3000],
  ["星期四", 4000, 1000],
  ["星期五", 1000, 3000],
  ["星期六", 5000, 1000],
  ["星期日", 7000, 2000],
];

/**
 * 折线图、柱状图多数据
 */
export const dataset_mult = [
  ["营业额", "零食", "饮料", "${虚线}水果生鲜", "日常用品"],
  ["星期一", 2500, 1000, 3000, 2000],
  ["星期二", 8000, 5000, 2000, 4000],
  ["星期三", 3000, 2000, 7000, 5000],
  ["星期四", 4000, 6000, 2000, 3000],
  ["星期五", 1000, 2000, 5000, 4000],
  ["星期六", 5000, 3000, 1000, 8000],
  ["星期日", 7000, 3000, 3000, 2000],
];

/**
 * 水球图数据（数据数量等于水球图波纹层级数量，3个0.56表示3层波纹）
 */
export const dataset_lf = [[0.56, 0.56, 0.56]]